app/controllers/blogs_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY id DESC
---
  def index
    @blogs = Article.includes(:user).all.order("id DESC")

INSERT INTO `articles` (`text`, `created_at`, `updated_at`) VALUES ('ああああ', '2019-03-12 08:02:14', '2019-03-12 08:02:14')
---
  def create
    @article = Article.new(create_params)
    @article.save(validate: false)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 6
---
  def destroy
    article = Article.find(params[:id])
    article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 0
---
  def edit
    @article = Article.find(params[:id])
    @article.destroy

INSERT INTO `articles` (`created_at`, `updated_at`) VALUES ('2019-03-12 07:57:53', '2019-03-12 07:57:53')
---
  def update
    article = Article.new(create_params)
    article.save(validate: false)